import sqlite3

# Подключение к базе данных
conn = sqlite3.connect('tournament.db')
c = conn.cursor()

# Вставка данных для каждой команды
teams_data = [
    ('Северсталь', 7, 10, 2, 5, 3, 1, 0, 1),
    ('Динамо Минск', 7, 9, 4, 5, 2, 1, 1, 1),
    ('Спартак', 7, 8, 4, 5, 2, 1, 1, 1),
    ('Динамо М', 4, 10, 10, 5, 1, 2, 0, 1),
    ('Металлург', 4, 10, 11, 5, 2, 3, 0, 0),
    ('Локомотив', 4, 6, 10, 5, 2, 3, 0, 0),
    ('Салават Юлаев', 9, 11, 2, 5, 3, 0, 0, 1),
    ('Авангард', 7, 8, 6, 6, 2, 2, 2, 0),
    ('Сибирь', 7, 18, 6, 6, 3, 1, 1, 1),
    ('Автомобилист', 7, 8, 11, 7, 3, 1, 3, 0),
    ('Трактор', 4, 10, 11, 5, 2, 3, 0, 0),
    ('Ак Барс', 4, 8, 9, 4, 1, 2, 1, 1)
]

# Выполнение вставки данных в таблицу
c.executemany('''INSERT INTO teams (name, points, goals_for, goals_against, games, wins, losses, overtime_wins, overtime_losses)
                  VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)''', teams_data)

# Сохранение изменений и закрытие соединения
conn.commit()
conn.close()

print("Данные успешно вставлены!")
